Revit 2017 API
AssetPropertyDoubleArray2d Class
 Represents a property consisting of an array of double values.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyDoubleArray2d : AssetProperty
Visual Basic
Public Class AssetPropertyDoubleArray2d _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDoubleArray2d : public AssetProperty
Remarks
 In virtually all cases, the array will contain exactly 2 values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyDoubleArray2d
See Also
AssetPropertyDoubleArray2d Members
Autodesk.Revit.Utility Namespace